/// @description контроллер снаряжения он постоянный и невидимый, хранит в себе информацию
	// по снаряжению, оружию и финансам, работатет с применением эффектов от снаряжения,
	// считает его износ и т.д.
	

// main
need_sv = 2;	// нужно ли сохранять данный объект
// имена переменных, которые не нужно сохранять
nonSvVar = ["nonSvVar", "init", "need_sv", "action", "inv_items"];	
action = "";
init = false;

// снаряжение
equ_cash = 0;			// деньги
inv_weight = 0;		// вес инвентаря
equ_wpn_act = "";	// Основное оружие, Вспомогательное оружие, Снаряга1, Снаряга2, Пистолет
equ_map_patrons = ds_map_create();	// словарь патронов и оружия
event_user(5);	// обнуление словаря патронов
equ_map_equ = ds_map_create();	// словарь снаряжения
// ["Предмет", количество, [["Доп инф парам", значение], ]]
equ_map_equ[?"Шапка"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Куртка"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Основное оружие"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Вспомогательное оружие"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Снаряга1"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Снаряга2"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Перчатки"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Пистолет"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Бронежилет"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Штаны"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
equ_map_equ[?"Ботинки"] = ["", 0, [["", 0], ["", 0], ["", 0], ["", 0]]];
	
inv_items = [[]];	// массив, который подготавливается при нажатии на tab, 
						// чтобы его мог скопировать контроллер инвентаря и передать КИ комнаты инвентаря





