/// @description подготовка массива inv_items для последующего копирования его контроллером инвентаря
	// просто для удобства, чтобы не делать это в контроллере инвентаря

if (room != rm_menu_inv) {
	
	inv_items = [[
		[equ_map_equ[?"Шапка"][0], equ_map_equ[?"Шапка"][1], equ_map_equ[?"Шапка"][2]],
		[equ_map_equ[?"Куртка"][0], equ_map_equ[?"Куртка"][1], equ_map_equ[?"Куртка"][2]],
		[equ_map_equ[?"Основное оружие"][0], equ_map_equ[?"Основное оружие"][1], equ_map_equ[?"Основное оружие"][2]],
		[equ_map_equ[?"Вспомогательное оружие"][0], equ_map_equ[?"Вспомогательное оружие"][1], equ_map_equ[?"Вспомогательное оружие"][2]],
		[equ_map_equ[?"Снаряга1"][0], equ_map_equ[?"Снаряга1"][1], equ_map_equ[?"Снаряга1"][2]],
		[equ_map_equ[?"Снаряга2"][0], equ_map_equ[?"Снаряга2"][1], equ_map_equ[?"Снаряга2"][2]],
		[equ_map_equ[?"Перчатки"][0], equ_map_equ[?"Перчатки"][1], equ_map_equ[?"Перчатки"][2]],
		[equ_map_equ[?"Пистолет"][0], equ_map_equ[?"Пистолет"][1], equ_map_equ[?"Пистолет"][2]],
		[equ_map_equ[?"Бронежилет"][0], equ_map_equ[?"Бронежилет"][1], equ_map_equ[?"Бронежилет"][2]],
		[equ_map_equ[?"Штаны"][0], equ_map_equ[?"Штаны"][1], equ_map_equ[?"Штаны"][2]],
		[equ_map_equ[?"Ботинки"][0], equ_map_equ[?"Ботинки"][1], equ_map_equ[?"Ботинки"][2]],
		
	]];
}

// сохраняю во второй массив, чтобы потом сравнивать и находить вновь добавленные элементы
// scr_equ_copyArr();
	
	