/// @description обнуление словаря патронов
	// делается после визита в инвентарь, чтобы заново заполнить, учитывая все изменения,
	// сделанные в инвентаре
equ_map_patrons[?"Патрон_9х18мм"] = 0;
equ_map_patrons[?"Патрон_5_45х39мм"] = 0;
equ_map_patrons[?"Патрон_7_62х54мм"] = 0;
equ_map_patrons[?"Патрон_12"] = 0;
equ_map_patrons[?"Патрон_шмель"] = 0;
equ_map_patrons[?"Патрон_ОНИХ1"] = 0;
equ_map_patrons[?"Патрон_ОНИХ2"] = 0;
equ_map_patrons[?"Патрон_граната1"] = 0;
equ_map_patrons[?"Патрон_граната2"] = 0;
equ_map_patrons[?"Патрон_молотов"] = 0;




