/// @description константы

//ОПИСАНИЕ ПРЕДМЕТОВ

global.CONST_PRODUCT = ds_map_create();

global.CONST_WEAPON = ds_map_create();

global.CONST_CRAFT_INSTRUCTION = ds_map_create();

global.CONST_AMULET = ds_map_create();		//!НЕ ГОТОВО

global.CONST_PATRON = ds_map_create();

global.CONST_CLOTHES = ds_map_create();

global.CONST_WEIGHT = ds_map_create();		//!НЕ ГОТОВО	

//просто коммент123
{
//ПРОДУКТЫ, НАПИТКИ И МЕДИКАМЕНТЫ
						//влияние на здоровье, голод, жажду, тепло, шизу, усталость, эффект
						//каждое значение задано границами рандома
global.CONST_PRODUCT[?"nut"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"apple"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"cucumber"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"carrot"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"friedPotatoe"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"boiledPotato"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"rolton"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"doshirak"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"pasta"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"chips"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"crackers"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"stewedMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"warmMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"armyConcentrate"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"bread"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"buckwheat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"hallucinMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"rottenMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"rawMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"friedMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"water"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"soda"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"cola"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"tea"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"coffe"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"alcohol"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"beer"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"vodka"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"SSSRVodka"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"cognac"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"diesel"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"bandage"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"sterileBandage"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];							
global.CONST_PRODUCT[?"stimulator"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"aspirin"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"pills"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"firstAid"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"armyFirstAid"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"bloodBag"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"adrenaline"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"antiradin"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"aspirin	"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
}

{
//ПАТРОНЫ
	//скорость полета пули, пробиваемость предметов (0-5)
global.CONST_PATRON[?"makarov"] = [[20, 30], /*скорость полета*/ [1, 1] /*пробиваемость*/];
global.CONST_PATRON[?"auto"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"drob"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"machine"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"rocket"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"HIAC1"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"HIAC2"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"grenade1"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"grenade2"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"coctail"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
}

{
//сопротивление холоду, урону, скорость, радиации, перегреву, уважение (все в процентах)
global.CONST_CLOTHES[?"valenki"] = [15, /*холод*/ 
									4, /*урону*/ 
									8, /*скорость*/ 
									0, /*радиации*/
									5, /*перегрев*/
									0];/*уважение*/
global.CONST_CLOTHES[?"cap"] = [4, /*холод*/ 
								0, /*урону*/ 
								0, /*скорость*/ 
								0, /*радиация*/ 
								0, /*перегрев*/
								20];/*уважение*/
global.CONST_CLOTHES[?"goldWatch"] = [0, /*холод*/ 
									  3, /*урону*/ 
									  0, /*скорость*/ 
									  0, /*радиация*/ 
									  0, /*перегрев*/
									  70];/*уважение*/
global.CONST_CLOTHES[?"downJacket"] = [20,  /*холод*/ 
										5,  /*урону*/ 
										-2, /*скорость*/ 
										0,  /*радиация*/ 
										10, /*перегрев*/
										0]; /*уважение*/
global.CONST_CLOTHES[?"steelworkerSuit"] = [10, /*холод*/ 
											10, /*урону*/ 
											-5, /*скорость*/ 
											5,  /*радиация*/ 
											100,/*перегрев*/
											10];/*уважение*/
global.CONST_CLOTHES[?"antiradiationSuit"] = [0, /*холод*/ 
											  0, /*урону*/ 
											  -7, /*скорость*/ 
											  100,/*радиация*/ 
											  0,  /*перегрев*/
											  0]; /*уважение*/
global.CONST_CLOTHES[?"bulletproof"] = [4, /*холод*/ 
										15, /*урону*/ 
										-5, /*скорость*/ 
										0,  /*радиация*/ 
										0,  /*перегрев*/
										0]; /*уважение*/
global.CONST_CLOTHES[?"snowshoes"] = [0, /*холод*/ 
									  0, /*урону*/ 
									  10,/*скорость*/ 
									  0, /*радиация*/ 
									  0, /*перегрев*/
									  0];/*уважение*/

}


{
//урон, патронов в обойме, скорострельность, скорость износа за выстрел, время действия, радиус поражения, грохот выстрела
global.CONST_WEAPON[?"makarov"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"makarov_M"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"auto"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"auto_M"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"auto_M2"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"drob"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"machine"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"rocket"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"HIAC1"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"HIAC2"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
	//А ТАК ЖЕ МОДИФИКАЦИИ ОНИХ					
global.CONST_WEAPON[?"grenade1"] = [[10, 20], /*урон*/
							1,		  /*патронов*/
							[1, 1],	  /*скорострельность*/
							[0, 0],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							10,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"grenade2"] = [[10, 20], /*урон*/
							1,		  /*патронов*/
							[1, 1],	  /*скорострельность*/
							[0, 0],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							10,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"coctail"] = [[10, 20], /*урон*/
							1,		  /*патронов*/
							[1, 1],	  /*скорострельность*/
							[0, 0],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							10,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
}
	
{
//ИНСТРУКЦИИ
	//есть или нет, при определенных действиях будет проверяться наличие
global.CONST_CRAFT_INSTRUCTION[?"tunnelMap1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"tunnelMap2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"tunnelMap3"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"tunnelMap4"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"tunnelMap5"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"ghostTownMap1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"ghostTownMap2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"ghostBaseMap1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"ghostBaseMap2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifMakarov1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifMakarov2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifAuto1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifAuto2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifAuto3"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifHIAC1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifHIAC2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifHIAC3"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifHIAC4"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingModifHIAC5"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingRocket1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingRocket2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingGrenade1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"drawingGrenade2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"repairInstructionAuto"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"repairInstructionMakarov"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"mechanicTextbook1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"mechanicTextbook2"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"mechanicTextbook3"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"engineeringTextbook"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"engineeringTextbook"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"psychologyTextbook"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"equipmentTextbook"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"instructionsInstallingTurret"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"instructionsCreatingTurret1"] = [false];
global.CONST_CRAFT_INSTRUCTION[?"instructionsCreatingTurret2"] = [false];

}
	
{
//ВЕС, МАКС. КОЛИЧЕСТВО И ЦЕНА
	//вес, макс. кол-во, цена
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, /*кол-во*/ 20/*цена*/];
}
