/// @description константы

//ОПИСАНИЕ ПРЕДМЕТОВ

//все, что можно съесть и влияние этого на параметры игрока
global.CONST_PRODUCT = ds_map_create();

//описание оружия
global.CONST_WEAPON = ds_map_create();

//чертежи и карты
global.CONST_DRAWINGS = ds_map_create();

//гипотетические предметы
global.CONST_AMULET = ds_map_create();		//!НЕ ГОТОВО

//описаник патронов
global.CONST_PATRON = ds_map_create();

//вещи
global.CONST_CLOTHES = ds_map_create();

//описание предметов
global.CONST_ITEMS = ds_map_create();

//вес
//global.CONST_WEIGHT = ds_map_create();		//!НЕ ГОТОВО

{
//ПРОДУКТЫ, НАПИТКИ И МЕДИКАМЕНТЫ
						//влияние на здоровье, голод, жажду, тепло, шизу, усталость, эффект
						//каждое значение задано границами рандома
global.CONST_PRODUCT[?"nut"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"apple"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"cucumber"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"carrot"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"friedPotatoe"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"boiledPotato"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"rolton"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"doshirak"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"pasta"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"chips"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"crackers"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"stewedMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"warmMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"armyConcentrate"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"bread"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"buckwheat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"hallucinMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"rottenMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"rawMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"friedMeat"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"water"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"soda"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"cola"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"tea"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"coffe"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"alcohol"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"beer"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"vodka"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"SSSRVodka"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"cognac"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"diesel"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"bandage"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"sterileBandage"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];							
global.CONST_PRODUCT[?"stimulator"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"aspirin"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"pills"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"firstAid"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"armyFirstAid"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"bloodBag"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"adrenaline"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"antiradin"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
global.CONST_PRODUCT[?"aspirin	"] = [[5, 10] /*жизни*/, [5, 10] /*голод*/,
							[0, 10] /*жажда*/, [5, 10] /*тепло*/, 
							[5, 10] /*шизу*/, [5, 10] /*усталость*/, 
							[] /*эффекты*/];
}

{
//ПАТРОНЫ
	//скорость полета пули, пробиваемость предметов (0-5)
global.CONST_PATRON[?"makarov"] = [[20, 30], /*скорость полета*/ [1, 1] /*пробиваемость*/];
global.CONST_PATRON[?"auto"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"drob"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"machine"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"rocket"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"HIAC1"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"HIAC2"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"grenade1"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"grenade2"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
global.CONST_PATRON[?"coctail"] = [[20, 30], /*скорость полета*/ [1, 1]/*пробиваемость*/];
}

{
//сопротивление холоду, урону, скорость, радиации, перегреву, уважение (все в процентах)
global.CONST_CLOTHES[?"valenki"] = [15, /*холод*/ 
									4, /*урону*/ 
									8, /*скорость*/ 
									0, /*радиации*/
									5, /*перегрев*/
									0];/*уважение*/
global.CONST_CLOTHES[?"cap"] = [4, /*холод*/ 
								0, /*урону*/ 
								0, /*скорость*/ 
								0, /*радиация*/ 
								0, /*перегрев*/
								20];/*уважение*/
global.CONST_CLOTHES[?"goldWatch"] = [0, /*холод*/ 
									  3, /*урону*/ 
									  0, /*скорость*/ 
									  0, /*радиация*/ 
									  0, /*перегрев*/
									  70];/*уважение*/
global.CONST_CLOTHES[?"downJacket"] = [20,  /*холод*/ 
										5,  /*урону*/ 
										-2, /*скорость*/ 
										0,  /*радиация*/ 
										10, /*перегрев*/
										0]; /*уважение*/
global.CONST_CLOTHES[?"steelworkerSuit"] = [10, /*холод*/ 
											10, /*урону*/ 
											-5, /*скорость*/ 
											5,  /*радиация*/ 
											100,/*перегрев*/
											10];/*уважение*/
global.CONST_CLOTHES[?"antiradiationSuit"] = [0, /*холод*/ 
											  0, /*урону*/ 
											  -7, /*скорость*/ 
											  100,/*радиация*/ 
											  0,  /*перегрев*/
											  0]; /*уважение*/
global.CONST_CLOTHES[?"bulletproof"] = [4, /*холод*/ 
										15, /*урону*/ 
										-5, /*скорость*/ 
										0,  /*радиация*/ 
										0,  /*перегрев*/
										0]; /*уважение*/
global.CONST_CLOTHES[?"snowshoes"] = [0, /*холод*/ 
									  0, /*урону*/ 
									  10,/*скорость*/ 
									  0, /*радиация*/ 
									  0, /*перегрев*/
									  0];/*уважение*/

}


{
//урон, патронов в обойме, скорострельность, скорость износа за выстрел, время действия, радиус поражения, грохот выстрела
global.CONST_WEAPON[?"makarov"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"makarov_M"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"auto"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"auto_M"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"auto_M2"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"drob"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"machine"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"rocket"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"HIAC1"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"HIAC2"] = [[10, 20], /*урон*/
							10,		  /*патронов*/
							[2, 3],	  /*скорострельность*/
							[2, 3],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							1,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
	//А ТАК ЖЕ МОДИФИКАЦИИ ОНИХ					
global.CONST_WEAPON[?"grenade1"] = [[10, 20], /*урон*/
							1,		  /*патронов*/
							[1, 1],	  /*скорострельность*/
							[0, 0],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							10,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"grenade2"] = [[10, 20], /*урон*/
							1,		  /*патронов*/
							[1, 1],	  /*скорострельность*/
							[0, 0],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							10,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
global.CONST_WEAPON[?"coctail"] = [[10, 20], /*урон*/
							1,		  /*патронов*/
							[1, 1],	  /*скорострельность*/
							[0, 0],	  /*износ в процентах*/
							[3, 4],	  /*время действия/жизни*/
							10,		  /*радиус поражения*/
							[10, 20]];/*шум выстрела*/
}
	
{
//ЧЕРТЕЖИ И КАРТЫ
	//есть или нет, при определенных действиях будет проверяться наличие
global.CONST_DRAWINGS[?"tunnelMap1"] = [false];
global.CONST_DRAWINGS[?"tunnelMap2"] = [false];
global.CONST_DRAWINGS[?"tunnelMap3"] = [false];
global.CONST_DRAWINGS[?"tunnelMap4"] = [false];
global.CONST_DRAWINGS[?"tunnelMap5"] = [false];
global.CONST_DRAWINGS[?"ghostTownMap1"] = [false];
global.CONST_DRAWINGS[?"ghostTownMap2"] = [false];
global.CONST_DRAWINGS[?"ghostBaseMap1"] = [false];
global.CONST_DRAWINGS[?"ghostBaseMap2"] = [false];
global.CONST_DRAWINGS[?"drawingModifMakarov1"] = [false];
global.CONST_DRAWINGS[?"drawingModifMakarov2"] = [false];
global.CONST_DRAWINGS[?"drawingModifAuto1"] = [false];
global.CONST_DRAWINGS[?"drawingModifAuto2"] = [false];
global.CONST_DRAWINGS[?"drawingModifAuto3"] = [false];
global.CONST_DRAWINGS[?"drawingModifHIAC1"] = [false];
global.CONST_DRAWINGS[?"drawingModifHIAC2"] = [false];
global.CONST_DRAWINGS[?"drawingModifHIAC3"] = [false];
global.CONST_DRAWINGS[?"drawingModifHIAC4"] = [false];
global.CONST_DRAWINGS[?"drawingModifHIAC5"] = [false];
global.CONST_DRAWINGS[?"drawingRocket1"] = [false];
global.CONST_DRAWINGS[?"drawingRocket2"] = [false];
global.CONST_DRAWINGS[?"drawingGrenade1"] = [false];
global.CONST_DRAWINGS[?"drawingGrenade2"] = [false];
global.CONST_DRAWINGS[?"repairInstructionAuto"] = [false];
global.CONST_DRAWINGS[?"repairInstructionMakarov"] = [false];
global.CONST_DRAWINGS[?"mechanicTextbook1"] = [false];
global.CONST_DRAWINGS[?"mechanicTextbook2"] = [false];
global.CONST_DRAWINGS[?"mechanicTextbook3"] = [false];
global.CONST_DRAWINGS[?"engineeringTextbook"] = [false];
global.CONST_DRAWINGS[?"engineeringTextbook"] = [false];
global.CONST_DRAWINGS[?"psychologyTextbook"] = [false];
global.CONST_DRAWINGS[?"equipmentTextbook"] = [false];
global.CONST_DRAWINGS[?"instructionsInstallingTurret"] = [false];
global.CONST_DRAWINGS[?"instructionsCreatingTurret1"] = [false];
global.CONST_DRAWINGS[?"instructionsCreatingTurret2"] = [false];

}
	
{
//описание предметов для инвентаря и журнала, здесь же вес
global.CONST_ITEMS[?""] = ["", //название для игрока
							1, //вес
							-1, //кол-во предметов на инвентарь
							-1, //кол-во предметов на ячейку
							"", //тип предмета (пища, снаряга, инструменты, детали, сюжет, мусор)
							"", //описание предмета
							"", //применение (для чего нужен) (крафт, продажа, использование)
							"", //редкость (Обычный , редкий, сюжетный, коллекционный)
							[10, 20], //цена покупки и продажи (нельзя продать сюжетный или коллекционный, если -1 - цена, тоже нельзя)
							[1, 1], //количество предмедметов в коробке
							10,	//жизни предмета
							false, //нужно ли удалять предмет после того, как он был поднят
];
	
}
//{
////ВЕС, МАКС. КОЛИЧЕСТВО И ЦЕНА
//	//вес, макс. кол-во на инвентарь, кол-во предметов на ячейку инвентаря, цена продажи (цена покупки на 25-45% дороже)
	
//global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, -1,/*кол-во*/ 10/*цена макс*/, 20/*цена мин*/];
//global.CONST_WEIGHT[?""] = [1, /*вес*/ -1, -1,/*кол-во*/ 10/*цена макс*/, 20/*цена мин*/];
//}
